src/cf/InformationRegisters/ОбменСВнешнимиСистемамиЛогированиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбменСВнешнимиСистемамиЛогированиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогированиеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьХраненияЗаписейДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаОтключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбменСВнешнимиСистемамиЛогированиеНастройки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере( Отказ, СтандартнаяОбработка )

	Если Не ЗначениеЗаполнено( Запись.ИсходныйКлючЗаписи ) Тогда
	
    	Запись.ЛогированиеВключено = Истина;
		Запись.ДлительностьХраненияЗаписейДней = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейПоУмолчанию();
		Запись.ПлановаяДатаОтключения = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаПоУмолчанию();
    	
  	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаОтключенияПриИзменении(Элемент)

	ДлительностьОтключенияЛогаДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьОтключенияЛогаДнейМаксимальная();
	ПлановаяДатаОтключенияРасчет = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаМаксимальная();
	Если Запись.ПлановаяДатаОтключения > ПлановаяДатаОтключенияРасчет Тогда

		Запись.ПлановаяДатаОтключения = ПлановаяДатаОтключенияРасчет;
		
		СообщениеТекстШаблон = НСтр( "ru = 'Изменена плановая дата отключения лога.
		|Максимальное количество дней: %1'" );
		СообщениеТекст = СтрШаблон( СообщениеТекстШаблон, ДлительностьОтключенияЛогаДнейМаксимальная );

		ПоказатьПредупреждение( , СообщениеТекст );

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьХраненияЗаписейДнейПриИзменении(Элемент)

	ДлительностьХраненияЗаписейДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейМаксимальная();
	Если Запись.ДлительностьХраненияЗаписейДней > ДлительностьХраненияЗаписейДнейМаксимальная Тогда

		Запись.ДлительностьХраненияЗаписейДней = ДлительностьХраненияЗаписейДнейМаксимальная;
		
		СообщениеТекстШаблон = НСтр( "ru = 'Изменена длительность хранения дней.
		|Максимальное количество дней: %1'" );
		СообщениеТекст = СтрШаблон(СообщениеТекстШаблон, ДлительностьХраненияЗаписейДнейМаксимальная );
		
		ПоказатьПредупреждение( , СообщениеТекст );

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере( Отказ, ТекущийОбъект, ПараметрыЗаписи )

	ОбменСВнешнимиСистемамиЛогирование.ЛогНастройкиПроверитьИЗаполнить( ТекущийОбъект );
	
КонецПроцедуры

#КонецОбласти
